# Core System
# Hyprland DE
hyprland
hypridle
hyprlock
hyprpicker
waybar
wofi
dunst
swww
grim
slurp
satty
wl-clipboard
cliphist
xdg-desktop-portal-hyprland
polkit-gnome
nwg-look
udiskie
brightnessctl
playerctl
pavucontrol
pipewire
pipewire-pulse
wireplumber
qt5ct
qt6ct
kvantum
kvantum-qt5
sddm

# Terminal & Shell
kitty
zsh
starship
tmux

# CLI Tools
btop
eza
lazygit
lazydocker
yazi
git
git-delta
github-cli
stow
fzf
ripgrep
tree
tldr
less
duf
fastfetch
glances
hyperfine
vivid
pv
nano
nano-syntax-highlighting
man-db
man-pages
wget
rsync
plocate
unrar
unzip
meld
diffutils
reflector
rebuild-detector
yq
zoxide

# Development
arduino-cli
neovim
pyenv
docker
docker-compose
yarn

# Browsers

# Gaming

# Fonts
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
cantarell-fonts
otf-font-awesome

# File Managers
nemo
thunar
thunar-archive-plugin
thunar-volman


# Media/Graphics
ffmpegthumbnailer
ffmpegthumbs
libdvdcss
poppler-glib
libgsf
libopenraw
kimageformats
qt6-imageformats

# X11/Wayland
xorg-server
xorg-xinit
xorg-xinput
xorg-xrandr
xorg-xdpyinfo
xorg-xkill
xf86-input-libinput
mesa-utils
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xsettingsd
xterm

# System Utilities
accountsservice
fwupd
gnome-keyring
haveged
hdparm
hwdetect
hwinfo
inxi
logrotate
lsscsi
rtkit
sane
sg3_utils
smartmontools
s-nail
sudo
sysfsutils
systemd-sysvcompat
texinfo
upower
usbutils
vdpauinfo
which

# Misc
aspell
bash-completion
dmidecode
flatpak
libappindicator-gtk3
libwnck3
mtools
perl
rofi
yadm
