# Core System
base
base-devel
linux
linux-headers
linux-lts
linux-lts-headers
linux-firmware
amd-ucode
mkinitcpio
efibootmgr
efitools
grub
os-prober
btrfs-progs
dosfstools
e2fsprogs
exfatprogs
f2fs-tools
jfsutils
nilfs-utils
xfsprogs
ntfs-3g
lvm2
cryptsetup
dmraid
device-mapper
mdadm


# Networking
networkmanager
network-manager-applet
networkmanager-openconnect
networkmanager-openvpn
iwd
firewalld
iptables-nft
openssh
sshpass
modemmanager
xl2tpd
nfs-utils
bind
dnsmasq
ethtool
usb_modeswitch
wpa_supplicant
inetutils
netctl
nss-mdns
ntp

# Audio/Video (PipeWire)
pipewire-alsa
pipewire-jack
pipewire-pulse
wireplumber
alsa-firmware
alsa-plugins
alsa-utils
gst-libav
gst-plugin-pipewire
gst-plugins-bad
gst-plugins-ugly
sof-firmware

# Bluetooth
bluedevil
bluez
bluez-utils
blueman

# Printing
cups
cups-browsed
cups-filters
cups-pdf
foomatic-db
foomatic-db-engine
foomatic-db-gutenprint-ppds
foomatic-db-nonfree
foomatic-db-nonfree-ppds
foomatic-db-ppds
gutenprint
hplip
ghostscript
gsfonts
print-manager
splix
system-config-printer

# KDE/Plasma (SDDM login manager needs these)
plasma-desktop
plasma-workspace
plasma-x11-session
plasma-nm
plasma-pa
plasma-firewall
plasma-disks
plasma-systemmonitor
plasma-browser-integration
kdeplasma-addons
sddm-kcm
powerdevil
power-profiles-daemon
kscreen
kgamma
kwallet-pam
kwayland-integration
kde-gtk-config
kde-cli-tools
breeze-gtk

# KDE Apps (optional - remove if you want to slim down)
ark
dolphin
dolphin-plugins
gwenview
haruna
kate
kcalc
kdeconnect
kdegraphics-thumbnailers
kdenetwork-filesharing
kinfocenter
kio-admin
kio-extras
kio-fuse
konsole
okular
spectacle

# Hyprland DE
hyprland
hypridle
hyprlock
swayidle
swaync
hyprpicker
waybar
wofi
dunst
swww
grim
slurp
satty
wl-clipboard
cliphist
xdg-desktop-portal-hyprland
polkit-gnome
nwg-look
udiskie
brightnessctl
playerctl
pavucontrol
qt5ct
qt6ct
kvantum
kvantum-qt5

# Terminal & Shell
kitty
ghostty
zsh
starship
tmux

# CLI Tools
btop
eza
lazygit
lazydocker
yazi
git
git-delta
github-cli
stow
fzf
ripgrep
tree
tldr
less
duf
fastfetch
glances
hyperfine
vivid
pv
nano
nano-syntax-highlighting
man-db
man-pages
wget
rsync
plocate
unrar
unzip
meld
diffutils
reflector
pkgfile
downgrade
pacman-contrib
rebuild-detector
yq
zoxide

# Development
arduino-cli
neovim
nvm
pyenv
python
python-packaging
python-pillow
python-pyqt5
python-pyqt6
python-defusedxml
python-reportlab
docker
docker-compose
yarn

# Browsers
firefox

# Gaming
steam

# Fonts
ttf-jetbrains-mono-nerd
ttf-nerd-fonts-symbols
ttf-nerd-fonts-symbols-mono
ttf-bitstream-vera
ttf-dejavu
ttf-liberation
ttf-opensans
noto-fonts
noto-fonts-cjk
noto-fonts-emoji
noto-fonts-extra
cantarell-fonts
woff2-font-awesome

# File Managers
nemo
thunar
thunar-archive-plugin
thunar-volman

# Document Viewer
zathura
zathura-pdf-mupdf

# Media/Graphics
ffmpegthumbnailer
ffmpegthumbs
libdvdcss
poppler-glib
libgsf
libopenraw
kimageformats
qt6-imageformats

# Theming
papirus-icon-theme

# X11/Wayland
xorg-server
xorg-xinit
xorg-xinput
xorg-xrandr
xorg-xdpyinfo
xorg-xkill
xf86-input-libinput
xf86-video-amdgpu
xf86-video-ati
mesa-utils
xdg-desktop-portal-kde
xdg-user-dirs
xdg-utils
xsettingsd
xterm

# System Utilities
accountsservice
fwupd
gnome-keyring
haveged
hdparm
hwdetect
hwinfo
inxi
logrotate
lsb-release
lsscsi
rtkit
sane
sg3_utils
smartmontools
s-nail
sudo
sysfsutils
systemd-sysvcompat
texinfo
upower
usbutils
vdpauinfo
which

# Misc
aspell
b43-fwcutter
bash-completion
dmidecode
flatpak
libappindicator
libwnck3
mtools
perl
rofi
sunshine
yadm
yay
